Model: "deeplab_drop0_ResNet152_categorical_crossentropy"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 256, 256, 1  0           []                               
                                2)]                                                               
                                                                                                  
 resnet (ResNet)                [(None, 64, 64, 256  43400640    ['input[0][0]']                  
                                ),                                                                
                                 (None, 16, 16, 102                                               
                                4)]                                                               
                                                                                                  
 aspp (ASPP)                    (None, 16, 16, 256)  7937536     ['resnet[0][1]']                 
                                                                                                  
 aspp_upsample (UpSampling2D)   (None, 64, 64, 256)  0           ['aspp[0][0]']                   
                                                                                                  
 low_level_conv_block (ConvBloc  (None, 64, 64, 48)  12528       ['resnet[0][0]']                 
 k)                                                                                               
                                                                                                  
 decoder_concat (Concatenate)   (None, 64, 64, 304)  0           ['aspp_upsample[0][0]',          
                                                                  'low_level_conv_block[0][0]']   
                                                                                                  
 decoder_conv_blocks (ConvBlock  (None, 64, 64, 256)  1292800    ['decoder_concat[0][0]']         
 )                                                                                                
                                                                                                  
 decoder_final_upsample (UpSamp  (None, 256, 256, 25  0          ['decoder_conv_blocks[0][0]']    
 ling2D)                        6)                                                                
                                                                                                  
 classifier_layer (Conv2D)      (None, 256, 256, 3)  771         ['decoder_final_upsample[0][0]'] 
                                                                                                  
==================================================================================================
Total params: 52,644,275
Trainable params: 52,511,187
Non-trainable params: 133,088
__________________________________________________________________________________________________

Epoch 00001: val_loss improved from inf to 456024.65625, saving model to /tmp/output_deeplab_drop0_ResNet152_categorical_crossentropy/model.h5

Epoch 00002: val_loss improved from 456024.65625 to 1023.03516, saving model to /tmp/output_deeplab_drop0_ResNet152_categorical_crossentropy/model.h5
